src/cf/Documents/вогДелегированиеПравДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>вогДелегированиеПравДоступа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.вогДелегированиеРолиИсполнителя</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецРоли</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеРолиИсполнителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольИсполнителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/вогДелегированиеПравДоступа/Forms/ФормаДокумента/Ext/Form/Module.bsl
// + Тищенко В.В.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВладелецРоли = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Объект.ДействуетС = НачалоДня(ТекущаяДата()) + 43200;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	НовыйПериод = Новый СтандартныйПериод(Объект.ДействуетС, ?(Объект.ДействуетПо='00010101',Объект.ДействуетПо,КонецДня(Объект.ДействуетС)));
	
	ФормаРедактирования 							= ПолучитьФорму("ОбщаяФорма.CRM_ФормаРедактированияПроизвольногоПериода");
	ФормаРедактирования.Период 						= НовыйПериод;
	ФормаРедактирования.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПолеБыстрогоОтбора_ПериодПриИзмененииЗавершение", ЭтаФорма);
	ФормаРедактирования.РежимОткрытияОкна 			= РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаРедактирования.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоступныеРоли(Команда)
	ЗаполнитьДоступныеРолиСервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПолеБыстрогоОтбора_ПериодПриИзмененииЗавершение(НовыйПериод, ДополнительныеПараметры) Экспорт
	
	Если НовыйПериод = Неопределено ИЛИ НовыйПериод = КодВозвратаДиалога.Отмена Тогда
		Возврат
	КонецЕсли;	
	
	Объект.ДействуетС 	= НовыйПериод.ДатаНачала;
	Объект.ДействуетПо 	= НовыйПериод.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеРолиСервер()

	Объект.ДоступныеРолиИсполнителя.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|ГДЕ
	|	ИсполнителиЗадач.Исполнитель = &Исполнитель");
	Запрос.УстановитьПараметр("Исполнитель",Объект.ВладелецРоли);
	Объект.ДоступныеРолиИсполнителя.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
 
#КонецОбласти

// - Тищенко В.В.
